app/controllers/location_sharings_controller.rb

INSERT INTO "shared_places" ("user_id", "shared_to", "shared_latitude", "shared_longitude", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
	def upload_shared_location

		lat=params[:lat]
		lng=params[:lng]
		shared_to_arr=params[:user_id_arr].split(',')
		if shared_to_arr.length == 1 && shared_to_arr[0].downcase=='public'
			share_place=SharedPlace.create_shared_location(lat,lng,shared_to_arr[0],current_user)