app/models/shared_place.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "shared_places" ("user_id", "shared_to", "shared_latitude", "shared_longitude", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
	def self.create_shared_location(lat,lng,shared_to,current_user)
		@user=User.find(current_user.id)
		@share_location=@user.shared_places.create(shared_latitude: lat,shared_longitude: lng, shared_to: "#{shared_to}")

SELECT "shared_places".* FROM "shared_places" WHERE (user_id=1)
SELECT "shared_places".* FROM "shared_places" WHERE (shared_to=1 or (shared_to='public' and user_id != 1))
---
	def self.get_my_shared_location(mode,current_user)
		coldef=ApplicationController.helpers.my_shared_places_grid_header_hash
		if mode.to_i==1
			user_shared_location_data=SharedPlace.where("user_id=#{current_user.id}")
		else
			user_shared_location_data=SharedPlace.where("shared_to='#{current_user.id}' or (shared_to='public' and user_id != #{current_user.id})")
		end
		_arr=[]
		user_shared_location_data.each do |row|

SELECT "shared_places".* FROM "shared_places" WHERE (shared_to='public' and user_id = 5)
---
	def self.get_all_public_shared_location_arr(username)
		user_id=User.get_id_from_username(username)
		all_public_shared_location_obj=SharedPlace.where("shared_to='public' and user_id = #{user_id}")
		all_coordinate_arr=[]
		all_public_shared_location_obj.each do |location_obj|