app/models/user.rb

	def self.find_for_database_authentication(warden_conditions)
		conditions = warden_conditions.dup
		if username = conditions.delete(:login)
			where(conditions.to_h).where(["lower(username) = :value OR lower(email) = :value", { :value => username }]).first
		elsif conditions.has_key?(:username) || conditions.has_key?(:email)
			where(conditions.to_h).first
---
SELECT "users".* FROM "users" WHERE (email='b@test') LIMIT $1  [["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."username" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["username", "a@test.com"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE (lower(username) = 'a@test.com' OR lower(email) = 'a@test.com') ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]

	def self.get_email_from_id(user_id)
		return User.find(user_id).email
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def self.get_id_from_username(username)
		return User.where("username='#{username}'").take["id"]
---
SELECT "users".* FROM "users" WHERE (email='soumya@test') LIMIT $1  [["LIMIT", 1]]

	def self.get_all_user_data_json
		all_users_data=User.all
		_arr=[]
		all_users_data.each do |user|
---
SELECT "users".* FROM "users"